




--------------- SOMETHING BETWEEN HERE BUT LOST SADLY ------------------------------







%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan30, changed state to up
ip ad
Core2(config-if)#ip address 192.168.30.2 255.255.255.0
Core2(config-if)#no sh
Core2(config-if)#ex
Core2(config)#int vlan 40
Core2(config-if)#
%LINK-5-CHANGED: Interface Vlan40, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan40, changed state to up
ip ad
Core2(config-if)#ip address 192.168.40.2 255.255.255.0
Core2(config-if)#no sh
Core2(config-if)#end
Core2#
%SYS-5-CONFIG_I: Configured from console by console

Core2#ip routing
         ^
% Invalid input detected at '^' marker.
	
Core2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Core2(config)#ip routing
Core2(config)#span
Core2(config)#spanning-tree vl
Core2(config)#spanning-tree vlan 30,40 roo
Core2(config)#spanning-tree vlan 30,40 root pri
Core2(config)#spanning-tree vlan 30,40 root primary 
Core2(config)#int ra f0/21-24
Core2(config-if-range)#channel-gr
Core2(config-if-range)#channel-group 1 mod
Core2(config-if-range)#channel-group 1 mode on
Core2(config-if-range)#
Creating a port-channel interface Port-channel 1

%LINK-5-CHANGED: Interface Port-channel1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Port-channel1, changed state to up

Core2(config-if-range)#show ether
Core2(config-if-range)#show etherch
Core2(config-if-range)#show etherchannel
                         ^
% Invalid input detected at '^' marker.
	
Core2(config-if-range)#end
Core2#
%SYS-5-CONFIG_I: Configured from console by console

Core2#show ethre
Core2#show ether
Core2#show etherchannel 
                Channel-group listing:
                ----------------------

Group: 1
----------
Group state = L2
Ports: 4 Maxports = 8
Port-channels: 1 Max Port-channels = 1
Protocol:    -
Core2#show etherchannel summ
Core2#show etherchannel summary 
Flags:  D - down        P - in port-channel
        I - stand-alone s - suspended
        H - Hot-standby (LACP only)
        R - Layer3      S - Layer2
        U - in use      f - failed to allocate aggregator
        u - unsuitable for bundling
        w - waiting to be aggregated
        d - default port


Number of channel-groups in use: 1
Number of aggregators:           1

Group  Port-channel  Protocol    Ports
------+-------------+-----------+----------------------------------------------

1      Po1(SU)           -      Fa0/21(P) Fa0/22(P) Fa0/23(P) Fa0/24(P) 
Core2#
Core2#
Core2#
Core2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Core2(config)#int vlan 10
Core2(config-if)#stan
Core2(config-if)#standby 1 ip 192.168.10.254
Core2(config-if)#stan
Core2(config-if)#standby 1 pri
Core2(config-if)#standby 1 priority 150
Core2(config-if)#stan
Core2(config-if)#standby 1
%HSRP-6-STATECHANGE: Vlan10 Grp 1 state Speak -> Standby
 pre
Core2(config-if)#standby 1 preempt 
Core2(config-if)#ex
Core2(config)#int vlan 20
Core2(config-if)#stan
Core2(config-if)#standby 1 ip 192.168.20.254
Core2(config-if)#stan
Core2(config-if)#standby 1 pr
Core2(config-if)#standby 1 pri
Core2(config-if)#standby 1 priority 150
Core2(config-if)#stan
Core2(config-if)#standby 1 pre
Core2(config-if)#standby 1 preempt 
Core2(config-if)#ex
Core2(config)#int vlan 30
Core2(config-if)#stan
Core2(config-if)#standby 1 ip 192.168.30.254
%HSRP-6-STATECHANGE: Vlan20 Grp 1 state Speak -> Standby

%HSRP-6-STATECHANGE: Vlan20 Grp 1 state Standby -> Active

Core2(config-if)#standby 1 ip 192.168.30.254
Core2(config-if)#stan
Core2(config-if)#standby 1 pri
Core2(config-if)#standby 1 priority 200
Core2(config-if)#stan
Core2(config-if)#standby 1 pre
Core2(config-if)#standby 1 preempt 
Core2(config-if)#ex
Core2(config)#i
 %HSRP-6-STATECHANGE: Vlan30 Grp 1 state Standby -> Active
Core2(config)#int vla
Core2(config)#int vlan 40
Core2(config-if)#sta
Core2(config-if)#standby 1 ip 192.168.40.254
Core2(config-if)#stan
Core2(config-if)#standby 1 pr
Core2(config-if)#standby 1 pri
Core2(config-if)#standby 1 priority 200
Core2(config-if)#stan
Core2(config-if)#standby 1 pre
Core2(config-if)#standby 1 preempt 
Core2(config-if)#
 %HSRP-6-STATECHANGE: Vlan40 Grp 1 state Standby -> Active
%IP-4-DUPADDR: Duplicate address 192.168.40.254 on Vlan40, sourced by 0010.114D.C502

Core2(config-if)#
Core2(config-if)#
Core2(config-if)#
Core2(config-if)#ex
Core2(config)#ip routing
Core2(config)#
Core2(config)#
Core2(config)#int g0/1
Core2(config-if)#no sh
Core2(config-if)#swi
Core2(config-if)#no swi
Core2(config-if)#no switchport 
Core2(config-if)#ip ad
Core2(config-if)#ip address 2.2.2.2 255.255.255.0
Core2(config-if)#ex
Core2(config)#int f0/20
Core2(config-if)#no swi
Core2(config-if)#no switchport 
Core2(config-if)#no sh
Core2(config-if)#no shutdown 
Core2(config-if)#ip add
Core2(config-if)#ip address 4.4.4.2 255.255.255.0
Core2(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/20, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/20, changed state to up
%IP-4-DUPADDR: Duplicate address 4.4.4.2 on FastEthernet0/20, sourced by 0006.2A64.B002

%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

Core2(config-if)#rou
Core2(config-if)#ex
Core2(config)#rou
Core2(config)#router os
Core2(config)#router ospf 1
Core2(config-router)#ne
Core2(config-router)#net
Core2(config-router)#network 4.4.4.0 0.0.0.255 ar
Core2(config-router)#network 4.4.4.0 0.0.0.255 area 0
Core2(config-router)#network 2.2.2.0 0.0.0.255 area 0
Core2(config-router)#network 192.168.10.0 0.0.0.255 area 0
Core2(config-router)#network 192.168.20.0 0.0.0.255 area 0
Core2(config-router)#network 192.168.30.0 0.0.0.255 area 0
Core2(config-router)#network 192.168.40.0 0.0.0.255 area 0
Core2(config-router)#
01:04:04: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.40.1 on Vlan10 from LOADING to FULL, Loading Done

01:04:04: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.40.1 on Vlan40 from LOADING to FULL, Loading Done

01:04:12: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.40.1 on Vlan20 from LOADING to FULL, Loading Done

01:04:15: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.40.1 on Vlan30 from LOADING to FULL, Loading Done

Core2(config-router)#
01:06:26: %OSPF-5-ADJCHG: Process 1, Nbr 6.6.6.2 on GigabitEthernet0/1 from LOADING to FULL, Loading Done