Switch>EN
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hos
Switch(config)#hostname Core1
Core1(config)#vlan 10
Core1(config-vlan)#name A
Core1(config-vlan)#rx
                    ^
% Invalid input detected at '^' marker.
	
Core1(config-vlan)#ex
Core1(config)#vlan 20
Core1(config-vlan)#name V
Core1(config-vlan)#name B
Core1(config-vlan)#ex
Core1(config)#vlan 30
Core1(config-vlan)#name C
Core1(config-vlan)#ex
Core1(config)#vlan 40
Core1(config-vlan)#name DataCenter
Core1(config-vlan)#ex
Core1(config)#do sh vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                Gig0/1, Gig0/2
10   A                                active    
20   B                                active    
30   C                                active    
40   DataCenter                       active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0

Core1(config)#
Core1#
%SYS-5-CONFIG_I: Configured from console by console

Core1#




--------------- SOMETHING BETWEEN HERE BUT LOST SADLY ------------------------------







Core1(config)#int vlan 30
Core1(config-if)#
%LINK-5-CHANGED: Interface Vlan30, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan30, changed state to up
ip ad
Core1(config-if)#ip address 192.168.30.1 255.255.255.0
Core1(config-if)#no sh
Core1(config-if)#int vlan 40
Core1(config-if)#
%LINK-5-CHANGED: Interface Vlan40, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan40, changed state to up

Core1(config-if)#ip ad
Core1(config-if)#ip address 192.168.40.1 255.255.255.0
Core1(config-if)#no sh
Core1(config-if)#ex
Core1(config)#ip routing
Core1(config)#span
Core1(config)#spanning-tree vl
Core1(config)#spanning-tree vlan 10,20 ro
Core1(config)#spanning-tree vlan 10,20 root pra
Core1(config)#spanning-tree vlan 10,20 root pri
Core1(config)#spanning-tree vlan 10,20 root primary 
Core1(config)#sp
Core1(config)#spanning-tree vlan 30,40 ro
Core1(config)#spanning-tree vlan 30,40 root seco
Core1(config)#int ra f0/21-24
Core1(config-if-range)#ch
Core1(config-if-range)#channel-gro
Core1(config-if-range)#channel-group 1 mode on
Core1(config-if-range)#
Creating a port-channel interface Port-channel 1

%LINK-5-CHANGED: Interface Port-channel1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Port-channel1, changed state to up

Core1(config-if-range)#END
Core1#
%SYS-5-CONFIG_I: Configured from console by console
conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Core1(config)#vlan 10
Core1(config)#vlan 10
Core1(config-vlan)#stan
Core1(config-vlan)#ex
Core1(config)#int vlan 10
Core1(config-if)#stan
Core1(config-if)#standby 1 ip 192.168.10.254
Core1(config-if)#stan
Core1(config-if)#standby 1 pri
Core1(config-if)#standby 1 priority 200
Core1(config-if)#stan
Core1(config-if)#standby 1 pre
Core1(config-if)#ex
Core1(config)#int vlan 20
Core1(config-if)#stan
Core1(config-if)#standby 1 ip 192,168,20.254
                              ^
% Invalid input detected at '^' marker.
	
Core1(config-if)#stan
Core1(config-if)#standby 1 pri
Core1(config-if)#standby 1 priority 200
Core1(config-if)#stan
Core1(config-if)#standby 1 pre
%HSRP-6-STATECHANGE: Vlan10 Grp 1 state Speak -> Standby

%HSRP-6-STATECHANGE: Vlan10 Grp 1 state Standby -> Active

Core1(config-if)#standby 1 pre
Core1(config-if)#ex'
                   ^
% Invalid input detected at '^' marker.
	
Core1(config-if)#ex
Core1(config)#int vlan 30
Core1(config-if)#stan
Core1(config-if)#standby 1 ip 192.168.30.254
Core1(config-if)#stan
Core1(config-if)#standby 1 pri
Core1(config-if)#standby 1 priority 150
Core1(config-if)#stan
Core1(config-if)#standby 1 pre
Core1(config-if)#ex
Core1(config)#int vlan 40
Core1(config-if)#stan
Core1(config-if)#standby 1 up
%HSRP-6-STATECHANGE: Vlan30 Grp 1 state Speak -> Standby

%HSRP-6-STATECHANGE: Vlan30 Grp 1 state Standby -> Ac
% Incomplete command.
Core1(config-if)#stan
Core1(config-if)#standby 1 ip 192.168.40.254
Core1(config-if)#stan
Core1(config-if)#standby 1 pri
Core1(config-if)#standby 1 priority 150
Core1(config-if)#stan
Core1(config-if)#standby 1 pre
Core1(config-if)#standby 1 preempt 
Core1(config-if)#ex
Core1(config)#end
Core1#
%SYS-5-CONFIG_I: Configured from console by console

Core1#
Core1#
%HSRP-6-STATECHANGE: Vlan40 Grp 1 state Speak -> Standby

%HSRP-6-STATECHANGE: Vlan40 Grp 1 state Standby -> Active

%HSRP-6-STATECHANGE: Vlan30 Grp 1 state Speak -> Standby

%HSRP-6-STATECHANGE: Vlan40 Grp 1 state Speak -> Standby
%IP-4-DUPADDR: Duplicate address 192.168.40.254 on Vlan40, sourced by 0010.114D.C502

Core1#
Core1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Core1(config)#int f0/20
Core1(config-if)#no sw
Core1(config-if)#no switchport 
Core1(config-if)#ip ad
Core1(config-if)#ip address 1.1.1.2 255.255.255.9
Bad mask 0xFFFFFF09 for address 1.1.1.2
Core1(config-if)#ip address 1.1.1.2 255.255.255.0
Core1(config-if)#no sh
Core1(config-if)#ex
Core1(config)#int g0/1
Core1(config-if)#no swi
Core1(config-if)#no switchport 
Core1(config-if)#no sh
Core1(config-if)#ip ad
Core1(config-if)#ip address 1.1.1.2 255.255.255.0
% 1.1.1.0 overlaps with FastEthernet0/20
Core1(config-if)#ip address 1.1.1.2 255.255.255.9
Bad mask 0xFFFFFF09 for address 1.1.1.2
Core1(config-if)#ex
Core1(config)#int f0/20
Core1(config-if)#no ip ad
Core1(config-if)#no ip address 
Core1(config-if)#ex
Core1(config)#int g0/1
Core1(config-if)#no sh
Core1(config-if)#no swi
Core1(config-if)#no switchport 
Core1(config-if)#ip ad
Core1(config-if)#ip address 1.1.1.2 255.255.255.0
Core1(config-if)#ex
Core1(config)#int f0/0
%Invalid interface type and number
Core1(config)#int f0/20
Core1(config-if)#ip ad
Core1(config-if)#ip address 3.3.3.1 255.255.255.0
Core1(config-if)#no sh
Core1(config-if)#ex
Core1(config)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

%LINK-5-CHANGED: Interface FastEthernet0/20, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/20, changed state to up

Core1(config)#
Core1(config)#int ra f0/21-24
Core1(config-if-range)#exit
Core1(config)#
Core1(config)#rout
Core1(config)#router os
Core1(config)#router ospf 1
Core1(config-router)#net
Core1(config-router)#network 1.1.1.1 0.0.0.255 are
Core1(config-router)#network 1.1.1.1 0.0.0.255 area 0
Core1(config-router)#network 3.3.3.3 0.0.0.255 area 0
Core1(config-router)#network 3.3.3.3 0.0.0.255 a
Core1(config-router)#network 192.168.10.0 0.0.0.255 area 0
Core1(config-router)#network 192.168.20.0 0.0.0.255 area 0
Core1(config-router)#network 192.168.30.0 0.0.0.255 area 0
Core1(config-router)#network 192.168.40.0 0.0.0.255 area 0
Core1(config-router)#
01:04:06: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.40.2 on Vlan10 from LOADING to FULL, Loading Done

01:04:06: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.40.2 on Vlan40 from LOADING to FULL, Loading Done

01:04:15: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.40.2 on Vlan20 from LOADING to FULL, Loading Done

01:04:17: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.40.2 on Vlan30 from LOADING to FULL, Loading Done

01:04:57: %OSPF-5-ADJCHG: Process 1, Nbr 5.5.5.2 on GigabitEthernet0/1 from LOADING to FULL, Loading Done

01:05:29: %OSPF-5-ADJCHG: Process 1, Nbr 5.5.5.2 on GigabitEthernet0/1 from LOADING to FULL, Loading Done

01:06:22: %OSPF-5-ADJCHG: Process 1, Nbr 6.6.6.2 on FastEthernet0/20 from LOADING to FULL, Loading Done

Core1(config-router)#
Core1#
%SYS-5-CONFIG_I: Configured from console by console

